<a href="https://colab.research.google.com/github/KatiaOrtiz20/Mineria_de_datos/blob/main/Avance1_PIA_Equipo5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**PRIMER AVANCE PIA**

---
Equipo : 

Grupo: 02

Integrantes:
1.   1799830 Ortiz Martinez Katia del Carmen
2.   1798584 Martinez Cervantes Mara Anahí 

1.   1821636 Avilés Zuñiga Lluvia Elizabeth
2.   1842108 Canizales Melchor Sebastian 



---

**1) Titulo de la base de datos**

Nombre con el que se encuentra en la pagina encontrada:

* Customer Personality Analysis 

URL:
* https://www.kaggle.com/imakash3011/customer-personality-analysis


**2) Introducción General**

El análisis de personalidad del cliente es un análisis detallado de los clientes ideales de una empresa. Ayuda a una empresa a comprender mejor a sus clientes y les facilita la modificación de productos de acuerdo con las necesidades, comportamientos e inquietudes específicas de los diferentes tipos de clientes.

El análisis de la personalidad del cliente ayuda a una empresa a modificar su producto en función de sus clientes objetivo de diferentes tipos de segmentos de clientes. Por ejemplo, en lugar de gastar dinero para comercializar un nuevo producto para cada cliente en la base de datos de la empresa, una empresa puede analizar qué segmento de clientes es más probable que compre el producto y luego comercializar el producto solo en ese segmento en particular.

**3) Descripcion de los datos**

Los tipos de datos que se pueden observar en esta base de datos son sacados de encuentas y se acomodan en una tabla con columnas y renglones, con sus nombres respectivos, describiendo al cliente. 

Las columnas de esta base de datos van desde los númericos, datos de fecha y texto corto, en donde el cliente describe su edad, su nivel de educación, año de nacimiento, fecha de cuando el cliente se vio involucrado con la tienda, entre otros.

**4) Justificación de los datos**

Esta base de datos nos llamó la atención, ya que como actuarios, en cualquier ambito al que nos dediquemos, tenemos que tener en cuenta la situción de nuestros clientes para poder dar así un mejor servicio y que este se adapte mejor a la situción del cliente.

Encontramos beneficioso el trabajar esto, y no solo con estos datos, como practica para así tener un mejor conocimiento a futuro, ya que es algo que nos será de gran utilidad y que mejor que esta base de datos para implementar las actuales y futuras herramientas que vayamos aprendiendo.

**5) Objetivo Final**

Nuestro objetivo final es que el usuario tenga la facilidad de encontrar las características de sus clientes para saber identificar la mejor manera de tratar a sus clientes o a cierto tipo de cliente. Esta base de datos puede ser de gran utilidad a la hora de querer empezar un nugecio propio, ya que el emprendedor podrá identificar que grupo de clientes es el más a decuado para su negocio.  

**6) Preguntas de Interés**

*¿Qué tanto gastan los clientes de edad mayor a 50 en estos productos?*   
*¿Qué tanta clientela menor a 30 años hay en este mercado?*

**7) Parte de la programación**

***Importar librerias y bases de datos***

In [ ]:
import pandas as pd
import numpy as np
import json
dc = pd.read_csv("marketing_campaign.csv")
print(dc)

         ID  Year_Birth   Education  ... Z_CostContact  Z_Revenue  Response
0      5524        1957  Graduation  ...             3         11         1
1      2174        1954  Graduation  ...             3         11         0
2      4141        1965  Graduation  ...             3         11         0
3      6182        1984  Graduation  ...             3         11         0
4      5324        1981         PhD  ...             3         11         0
...     ...         ...         ...  ...           ...        ...       ...
2235  10870        1967  Graduation  ...             3         11         0
2236   4001        1946         PhD  ...             3         11         0
2237   7270        1981  Graduation  ...             3         11         0
2238   8235        1956      Master  ...             3         11         0
2239   9405        1954         PhD  ...             3         11         1

[2240 rows x 29 columns]

***Vizualización de los datos***

In [ ]:
a = dc.shape
print("Esta base de datos es de:",a)

Esta base de datos es de: (2240, 29)

In [ ]:
b = dc.columns
print("La base de datos tiene columnas llamadas:",b)

La base de datos tiene columnas llamadas: Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

***Tipo de dato de cada columna.***

In [ ]:
dc.dtypes

ID                       int64
Year_Birth               int64
Education               object
Marital_Status          object
Income                 float64
Kidhome                  int64
Teenhome                 int64
Dt_Customer             object
Recency                  int64
MntWines                 int64
MntFruits                int64
MntMeatProducts          int64
MntFishProducts          int64
MntSweetProducts         int64
MntGoldProds             int64
NumDealsPurchases        int64
NumWebPurchases          int64
NumCatalogPurchases      int64
NumStorePurchases        int64
NumWebVisitsMonth        int64
AcceptedCmp3             int64
AcceptedCmp4             int64
AcceptedCmp5             int64
AcceptedCmp1             int64
AcceptedCmp2             int64
Complain                 int64
Z_CostContact            int64
Z_Revenue                int64
Response                 int64
dtype: object

In [ ]:
c = dc.isnull().sum()
print("Evidencia de que hay o no hay numeros nulos",c)

Evidencia de que hay o no hay numeros nulos ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

***Organización de los datos***

In [ ]:
dcnew=dc.drop(['AcceptedCmp5','AcceptedCmp4','AcceptedCmp3','AcceptedCmp2','AcceptedCmp1','Z_CostContact','Z_Revenue','NumWebVisitsMonth','Response','Complain','NumDealsPurchases'],axis=1)
print(dcnew)
#Decidimos todo lo relacionado con quejas, y reacciones a los descuentos ya que no es información 
#relevante para nuestro trabajo

         ID  Year_Birth  ... NumCatalogPurchases NumStorePurchases
0      5524        1957  ...                  10                 4
1      2174        1954  ...                   1                 2
2      4141        1965  ...                   2                10
3      6182        1984  ...                   0                 4
4      5324        1981  ...                   3                 6
...     ...         ...  ...                 ...               ...
2235  10870        1967  ...                   3                 4
2236   4001        1946  ...                   2                 5
2237   7270        1981  ...                   3                13
2238   8235        1956  ...                   5                10
2239   9405        1954  ...                   1                 4

[2240 rows x 18 columns]

***Cambiar nombres de columnas.***

Decidimos crear una columna extra donde podamos ver la edad de los clientes

In [ ]:
from datetime import date

dc_cleaned = dcnew.dropna()
def get_age(añodenac):
    return date.today().year - añodenac
Edades = dc_cleaned.Year_Birth.map(get_age)
dc_cleaned["Age"] = dc_cleaned.Year_Birth.map(get_age)
dc_cleaned.Age.describe()
dc_cleaned.sort_values(by = 'Year_Birth').head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

         ID  Year_Birth Education  ... NumCatalogPurchases  NumStorePurchases  Age
239   11004        1893  2n Cycle  ...                   0                  2  128
339    1150        1899       PhD  ...                   6                  4  122
192    7829        1900  2n Cycle  ...                   1                  2  121
1950   6663        1940       PhD  ...                   1                  4   81
424    6932        1941       PhD  ...                  10                  5   80

[5 rows x 19 columns]

De aquí podemos observar que existen 3 personas con edades arriba de los 100 años lo que es demasiado extraño por lo que serán eliminados de la información

In [ ]:
dc_cleaned.drop([239,339,192], axis=0) #Aquí eliminaremos la información de estas personas

         ID  Year_Birth  ... NumStorePurchases Age
0      5524        1957  ...                 4  64
1      2174        1954  ...                 2  67
2      4141        1965  ...                10  56
3      6182        1984  ...                 4  37
4      5324        1981  ...                 6  40
...     ...         ...  ...               ...  ..
2235  10870        1967  ...                 4  54
2236   4001        1946  ...                 5  75
2237   7270        1981  ...                13  40
2238   8235        1956  ...                10  65
2239   9405        1954  ...                 4  67

[2213 rows x 19 columns]

Ahora vamos a cambiar el nombre de las columnas para un mejor entendimiento

In [ ]:
dcEsp=dc_cleaned.rename(columns
          = {'Year_Birth': 'Año_de_Nac','Education':'Educación','Marital_Status':'Estado Civil','Income':'Ingreso Anual','Kidhome':'Niños en casa','Teenhome':'Adolescentes en casa','Dt_Customer':'Fecha de inscripción a la empresa','Recency':'#Dias desde la ult compra','MntWines':'Gasto en Vino','MntFruits':'Gasto en Fruta','MntMeatProducts':'Gasto en Carne','MntFishProducts':'Gasto en Pescado','MntSweetProducts':'Gasto en Dulces','MntGoldProds':'Gasto en Oro','NumWebPurchases':'#Compras en Linea','NumCatalogPurchases':'#Compras por Catálogo','NumStorePurchases':'#Compras en Tienda','Age':'Edad'})
print(dcEsp)

         ID  Año_de_Nac  ... #Compras en Tienda Edad
0      5524        1957  ...                  4   64
1      2174        1954  ...                  2   67
2      4141        1965  ...                 10   56
3      6182        1984  ...                  4   37
4      5324        1981  ...                  6   40
...     ...         ...  ...                ...  ...
2235  10870        1967  ...                  4   54
2236   4001        1946  ...                  5   75
2237   7270        1981  ...                 13   40
2238   8235        1956  ...                 10   65
2239   9405        1954  ...                  4   67

[2216 rows x 19 columns]

***Guardar otros archivos con agrupaciones.***

In [ ]:
Edad= dcEsp[dcEsp['Edad']==50]
Edad.to_csv('Solo_Clientesde50años.csv', index=False)
print(Edad) #Aquí agrupamos a las personas de 50 años

         ID  Año_de_Nac  ... #Compras en Tienda Edad
6       965        1971  ...                  7   50
65     8082        1971  ...                  2   50
232    1606        1971  ...                  2   50
242   10735        1971  ...                  2   50
293    4927        1971  ...                  3   50
...     ...         ...  ...                ...  ...
2119   6147        1971  ...                  2   50
2141   9216        1971  ...                  3   50
2146   1818        1971  ...                  2   50
2178   4377        1971  ...                  3   50
2191   2656        1971  ...                  2   50

[86 rows x 19 columns]

***Responder las preguntas de interés.***

¿Para qué me puede servir estas agrupaciones? 
Para poder separar en subgrupos los datos dependiendo de cómo lo deseemos analizar en el proceso

___________________________________________________________________________

**1) Titulo de la base de datos secundaria**

Nombre con el que se encuentra en la pagina encontrada:

* Heart Failure Prediction 

URL:
* https://www.kaggle.com/andrewmvd/heart-failure-clinical-data  


**2) Introducción General**

Las enfermedades cardiovasculares (ECV) son la principal causa de muerte a nivel mundial, cobrando un estimado de 17,9 millones de vidas cada año, lo que representa el 31% de todas las muertes en todo el mundo.La insuficiencia cardíaca es un evento común causado por las enfermedades cardiovasculares y este conjunto de datos contiene 12 características que pueden usarse para predecir la mortalidad por insuficiencia cardíaca.

La mayoría de las enfermedades cardiovasculares se pueden prevenir abordando los factores de riesgo conductuales como el consumo de tabaco, las dietas malsanas y la obesidad, la inactividad física y el consumo nocivo de alcohol utilizando estrategias para toda la población.

**3) Descripción de los datos.**   

Los tipos de datos que se pueden apreciar en esta base de datos son del tipo de gráficos y numéricos, cada uno marcando una característica particular de los pacientes que se involucran en este análisis.

En las columnas podemos observar que describen ya sea el nivel de plaquetas que manejan los pacientes, su tipo de sexo de forma binaria, si padece de alguna enfermedad con números booleanos. Los datos se preservan de forma númerica para ser más sencilla su observación. 

**4) Justificación del uso de datos.**  

El motivo que nos impulsó a hacer uso y practica de esta base de datos es que es de gran importancia y a la vez interesante, en cómo algunos factores en cierta cantidad de pacientes pueden ser repetitivos, y así poder prevenir y mejorar con tratamiento a tiempo y de forma adecuada.

Es beneficioso trabajar con estos datos, ya que, a parte de ponernos en perspectiva a nosotros mismos comparandonos con los datros, podemos sacar provecho y sacar información importante que nos pueda ser de utilidad no solo para este proyecto si no también para futuro.

**5) Objetivo final.**  

Nuestro objetivo principal sería que el consultante pueda encontrar de froma más optima y rápida los datos que sean de su interes. Y sea que este quiera analizar algún patro en cierto rango de edad, o si se padece cierta enfermedad qué más podría ser capaz de adquirir, etc.

Deseamos involucrar un filtrado para que el usuario introduzca la categoría o característica que sea de su interés en esta base, y así facilitarle la búsqueda de su informaicón.

**6) Preguntas de interés.**

*¿Qué enfermedades son más típicas a los 20's?*  
*Si tengo nivel bajo de plaquetas, ¿qué enfermedad puedo contraer?*

**7) Parte de programación.**

**Importar base de datos**

In [ ]:
import pandas as pd
import numpy as np
import json
df = pd.read_csv("heart_failure_clinical_records_dataset.csv")
print(df)

      age  anaemia  creatinine_phosphokinase  ...  smoking  time  DEATH_EVENT
0    75.0        0                       582  ...        0     4            1
1    55.0        0                      7861  ...        0     6            1
2    65.0        0                       146  ...        1     7            1
3    50.0        1                       111  ...        0     7            1
4    65.0        1                       160  ...        0     8            1
..    ...      ...                       ...  ...      ...   ...          ...
294  62.0        0                        61  ...        1   270            0
295  55.0        0                      1820  ...        0   271            0
296  45.0        0                      2060  ...        0   278            0
297  45.0        0                      2413  ...        1   280            0
298  50.0        0                       196  ...        1   285            0

[299 rows x 13 columns]

**Visualización de los datos**

In [ ]:
a2 = df.shape
print("Esta base de datos es de:",a2)

Esta base de datos es de: (299, 13)

In [ ]:
b2 = df.columns
print("La base de datos tiene columnas llamadas:",b2)

La base de datos tiene columnas llamadas: Index(['age', 'anaemia', 'creatinine_phosphokinase', 'diabetes',
       'ejection_fraction', 'high_blood_pressure', 'platelets',
       'serum_creatinine', 'serum_sodium', 'sex', 'smoking', 'time',
       'DEATH_EVENT'],
      dtype='object')

In [ ]:
c2 = df.isnull().sum()
print("Evidencia de que hay o no hay numeros nulos",c2)

Evidencia de que hay o no hay numeros nulos age                         0
anaemia                     0
creatinine_phosphokinase    0
diabetes                    0
ejection_fraction           0
high_blood_pressure         0
platelets                   0
serum_creatinine            0
serum_sodium                0
sex                         0
smoking                     0
time                        0
DEATH_EVENT                 0
dtype: int64

**Tipo de dato de cada columna.**

In [ ]:
df.dtypes

age                         float64
anaemia                       int64
creatinine_phosphokinase      int64
diabetes                      int64
ejection_fraction             int64
high_blood_pressure           int64
platelets                   float64
serum_creatinine            float64
serum_sodium                  int64
sex                           int64
smoking                       int64
time                          int64
DEATH_EVENT                   int64
dtype: object